tap "adoptopenjdk/openjdk"
tap "anomalyco/tap"
tap "openclaw/tap"
tap "oven-sh/bun"
tap "sst/tap"
tap "steipete/tap"
tap "yakitrak/yakitrak"

brew "fzf"
brew "gh"
brew "git"
brew "jq"
brew "mas"
brew "mise"
brew "pandoc"
brew "python@3.14"
brew "pipx"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "anomalyco/tap/opencode"
brew "oven-sh/bun/bun"
brew "yakitrak/yakitrak/obsidian-cli"
brew "starship"
brew "bat"
brew "chezmoi"
brew "age"

cask "arc"
cask "claude-code"
cask "docker-desktop"
cask "font-fira-code"
cask "google-chrome"
cask "karabiner-elements"
cask "ngrok"
cask "obsidian"
cask "opencode-desktop"
cask "raycast"
cask "slack"
cask "temurin@8"
cask "visual-studio-code"
cask "warp"
cask "cmux"
cask "zed"
cask "displaylink"

mas "Kindle", id: 302584613
mas "LINE", id: 539883307

vscode "bierner.markdown-mermaid"
vscode "cweijan.vscode-typora"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "google.geminicodeassist"
vscode "gruntfuggly.todo-tree"
vscode "hediet.vscode-drawio"
vscode "mhutchie.git-graph"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-vscode-remote.remote-containers"
vscode "prisma.prisma"
vscode "ritwickdey.liveserver"
vscode "rooveterinaryinc.roo-cline"
vscode "vscode-icons-team.vscode-icons"
vscode "wayou.vscode-todo-highlight"

cargo "mt"
